export const languageText = `Перед тем как начать тест, выберите язык, на котором вам удобнее проходить 👇  
Тесті бастамас бұрын, өзіңізге ыңғайлы тілді таңдаңыз 👇  

*Цифрды енгізіңіз / Санын жазыңыз:*

1️⃣ Русский  
2️⃣ Қазақша

❗ Пожалуйста, введите только одну цифру: 1, 2 или 3  
❗ Тек бір ғана санды енгізіңіз: 1, 2 немесе 3`;

export const errLanguageText = `
Пожалуйста, введите 1 или 2  
Өтінеміз, 1 немесе 2 санын енгізіңіз
`

export const menuRu = (data: {
  parent: {
    fullName: string;
    phone: string;
  };
  child: {
    fullName: string;
    birthDate: string;
    language: string;
  };
}) => `👤 *Профиль родителя*

*ФИО:*  
_${data.parent.fullName}_

📞 *Телефон:*  
_${data.parent.phone}_

━━━━━━━━━━━━━━
👶 *Данные ребёнка*

*ФИО:*  
_${data.child.fullName}_

🎂 *Дата рождения:*  
_${data.child.birthDate}_

🗣 *Язык:*  
_${data.child.language}_

━━━━━━━━━━━━━━
Что вы хотите сделать дальше? 👇

1️⃣ *Начать тест*  
2️⃣ *Добавить ребёнка*  
3️⃣ *Редактировать данные*

_Введите цифру: 1, 2 или 3_`;


export const menuKz = (data: {
  parent: {
    fullName: string;
    phone: string;
  };
  child: {
    fullName: string;
    birthDate: string;
    language: string;
  };
}) => `👤 *Профиль родителя*

*ФИО:*  
_${data.parent.fullName}_

📞 *Телефон:*  
_${data.parent.phone}_

━━━━━━━━━━━━━━
👶 *Данные ребёнка*

*ФИО:*  
_${data.child.fullName}_

🎂 *Дата рождения:*  
_${data.child.birthDate}_

🗣 *Язык:*  
_${data.child.language}_

━━━━━━━━━━━━━━
Что вы хотите сделать дальше? 👇

1️⃣ *Начать тест*  
2️⃣ *Добавить ребёнка*  
3️⃣ *Редактировать данные*

_Введите цифру: 1, 2 или 3_`;



export const noChildProfileRu = (
  parentFullName: string,
  parentPhone: string
) => `👤 *Ваш профиль*

*ФИО:*  
_${parentFullName}_

📞 *Телефон:*  
_${parentPhone}_

━━━━━━━━━━━━━━
👶 *Дети не найдены.*

Чтобы продолжить, укажите *ФИО ребёнка* 👇`;


export const noChildProfileKz = (
  parentFullName: string,
  parentPhone: string
) => `👤 *Сіздің профиліңіз*

*Аты-жөні:*  
_${parentFullName}_

📞 *Телефон нөмірі:*  
_${parentPhone}_

━━━━━━━━━━━━━━
👶 *Балалар табылмады.*

Жалғастыру үшін *баланың аты-жөнін* жазыңыз 👇`;



export const askParentNameRu = `*Пожалуйста, укажите ФИО родителя:*  
Напишите полностью, например:  
*Иванова Мария Петровна*`;

export const askParentNameKz = `*Ата-ананың толық аты-жөнін көрсетіңіз:*  
Мысалы: *Иванова Мария Петровна*`;



export const askParentPhoneRu = 
`📞 *Введите номер телефона родителя*
❗ Номер обязательно должен начинаться с *8*
Формат: *87071234567*`;

export const askParentPhoneKz = 
`📞 *Ата-ананың телефон нөмірін енгізіңіз*
❗ Нөмір міндетті түрде *8*-ден басталуы керек
Формат: *87071234567*`;

export const invalidPhoneRu =
`❌ *Неверный формат номера*
Номер должен:
• начинаться с *8*
• содержать *11 цифр*

Пример: *87071234567*`;

export const invalidPhoneKz =
`❌ *Телефон нөмірінің форматы қате*
Нөмір:
• *8*-ден басталуы керек
• *11 саннан* тұруы керек

Мысал: *87071234567*`;

export const errTestAnswerRu = `❌ Неверный ответ. Пожалуйста, введите цифру 1, 2 или 3`;
export const errTestAnswerKz = `❌ Қате жауап. 1, 2 немесе 3 санын енгізіңіз`;

export const errAgeRangeRu = `Возраст ребёнка вне диапазона 2–7 лет. Тест доступен только для детей 2–7 лет.`;
export const errAgeRangeKz = `Баланың жасы 2–7 жас аралығында емес. Тест тек 2–7 жасқа арналған.`;



export const askChildLanguageRu = `*На каком языке ребёнок чаще всего говорит дома?*  
Выберите соответствующую цифру 👇  
*Например, если ребёнок чаще говорит на русском, напишите 2*

1️⃣ Русский  
2️⃣ Казахский  
3️⃣ На двух языках`;

export const askChildLanguageKz = `*Үйде бала көбіне қай тілде сөйлейді?*  
Сәйкес цифрды таңдаңыз 👇  
*Мысалы, егер бала көбіне қазақша сөйлесе, 1 деп жазыңыз*

1️⃣ Орысша
2️⃣ Қазақша
3️⃣ Екі тілде `;


export const askChildFullNameRu = `*Укажите ФИО ребёнка:*  
Напишите полностью, например:  
*Иванов Артём Сергеевич*`;

export const askChildFullNameKz = `*Баланың толық аты-жөнін көрсетіңіз:*  
Мысалы:  
*Иванов Артём Сергеевич*`;



export const askChildAgeRu = `*Укажите точный возраст ребёнка:*  
Введите число лет ребёнка, чтобы указать его реальный возраст 👇

Например: *4* — это значит, что ребёнку 4 года

❗ Введите только одно число от 2 до 7`;

export const askChildAgeKz = `*Баланың нақты жасын көрсетіңіз:*  
Баланың нақты жасын санмен енгізіңіз 👇

Мысалы: *4* — бұл баланың 4 жаста екенін білдіреді

❗ Тек 2 мен 7 аралығындағы бір санды енгізіңіз`;


export const askChildBirthDateRu = `🎂 *Укажите дату рождения ребёнка:*  
Формат: *ДД.ММ.ГГГГ*  
Пример: _27.04.2018_`;
export const askChildBirthDateKz = `🎂 *Баланың туған күнін көрсетіңіз:*  
Формат: *КК.АА.ЖЖЖЖ*  
Мысалы: _27.04.2018_`;


export const errDateRu = `❌ Неверный формат даты
Введите в формате *ДД.ММ.ГГГГ*, например _27.04.2018_
`
export const errDateKz = `❌ Күн форматы қате
*КК.АА.ЖЖЖЖ* форматында енгізіңіз, мысалы _27.04.2018_
`
