export const languageText = `Перед тем как начать тест, выберите язык, на котором вам удобнее проходить:  
Қай тілде тесті өту ыңғайлы екенін таңдаңыз:  
Choose the language you prefer for the test:  

Варианты:  
- русский
- қазақша  
- english  

Тек қана бір нұсқаны мәтін арқылы жазыңыз.  
Напишите только один вариант текстом.  
Write only one option in text.`;

export const welcomeRu = `*Здравствуйте!* 👋  
Вы находитесь в сервисе *скрининговой оценки речевого развития ребёнка*.
⏱ *Время прохождения:* несколько минут  
❗ _Результаты носят рекомендательный характер_ и *не являются медицинским диагнозом*.
👉 *Чтобы начать, напишите:*  
*начать тест*`;

export const welcomeKz = `*Сәлеметсіз бе!* 👋  
Сіз *2–7 жас аралығындағы баланың сөйлеу дамуын скринингтік бағалау* сервисінде отырсыз.
⏱ *Тесті өту уақыты:* бірнеше минут  
❗ _Нәтижелер ақпараттық сипатта және медициналық диагноз емес_.
👉 *Бастау үшін жазыңыз:*  
*тесті бастау*`;

export const welcomeEn = `*Hello!* 👋  
You are using the *child speech development screening service*.
⏱ *Estimated time:* a few minutes  
❗ _Results are for guidance only and do not constitute a medical diagnosis_.
👉 *To start, type:*  
*start test*`;



export const askParentNameRu = `*Пожалуйста, укажите ФИО родителя:*  
Напишите полностью, например:  
*Иванова Мария Петровна*`;

export const askParentNameKz = `*Ата-ананың толық аты-жөнін көрсетіңіз:*  
Мысалы: *Иванова Мария Петровна*`;

export const askParentNameEn = `*Please enter the full name of the parent:*  
For example: *Maria Ivanova*`;


export const askParentPhoneRu = `*Укажите номер телефона родителя:*  
Например:  
*+7 777 123 45 67*`;

export const askParentPhoneKz = `*Ата-ананың телефон нөмірін көрсетіңіз:*  
Мысалы:  
*+7 777 123 45 67*`;
export const askParentPhoneEn = `*Please enter the parent’s phone number:*  
For example:  
*+7 777 123 45 67*`;    



export const askChildLanguageRu = `*На каком языке ребёнок чаще всего говорит дома?*  
Выберите соответствующую цифру 👇  
*Например, если ребёнок чаще говорит на русском, напишите 2*

1️⃣ Русский  
2️⃣ Казахский  
3️⃣ На двух языках`;

export const askChildLanguageKz = `*Үйде бала көбіне қай тілде сөйлейді?*  
Сәйкес цифрды таңдаңыз 👇  
*Мысалы, егер бала көбіне қазақша сөйлесе, 1 деп жазыңыз*

1️⃣ Орысша
2️⃣ Қазақша
3️⃣ Екі тілде `;

export const askChildLanguageEn = `*Which language does the child mostly speak at home?*  
Please choose the number 👇  
*For example, if the child mostly speaks Kazakh, type 1*

1️⃣ Russian  
2️⃣ Kazakh  
3️⃣ Two languages`;

export const askChildFullNameRu = `*Укажите ФИО ребёнка:*  
Напишите полностью, например:  
*Иванов Артём Сергеевич*`;

export const askChildFullNameKz = `*Баланың толық аты-жөнін көрсетіңіз:*  
Мысалы:  
*Иванов Артём Сергеевич*`;

export const askChildFullNameEn = `*Please enter the child’s full name:*  
For example:  
*Artem Ivanov Sergeevich*`;



export const askChildAgeRu = `*Укажите точный возраст ребёнка:*  
Введите число лет ребёнка, чтобы указать его реальный возраст 👇

Например: *4* — это значит, что ребёнку 4 года

❗ Введите только одно число от 2 до 7`;

export const askChildAgeKz = `*Баланың нақты жасын көрсетіңіз:*  
Баланың нақты жасын санмен енгізіңіз 👇

Мысалы: *4* — бұл баланың 4 жаста екенін білдіреді

❗ Тек 2 мен 7 аралығындағы бір санды енгізіңіз`;

export const askChildAgeEn = `*Enter the child’s exact age:*  
Type the child’s age as a number to indicate the real age 👇

For example: *4* — means the child is 4 years old

❗ Please enter only one number between 2 and 7`;
