export const languageText = `Перед тем как начать тест, выберите язык, на котором вам удобнее проходить:  
Қай тілде тесті өту ыңғайлы екенін таңдаңыз:  
Choose the language you prefer for the test:  

Варианты:  
- русский
- қазақша  
- english  

Тек қана бір нұсқаны мәтін арқылы жазыңыз.  
Напишите только один вариант текстом.  
Write only one option in text.`;

export const welcomeRu = `*Здравствуйте!* 👋  
Вы находитесь в сервисе *скрининговой оценки речевого развития ребёнка*.
⏱ *Время прохождения:* несколько минут  
❗ _Результаты носят рекомендательный характер_ и *не являются медицинским диагнозом*.
👉 *Чтобы начать, напишите:*  
*начать тест*`;

export const askParentNameRu = `*Пожалуйста, укажите ФИО родителя:*  
Напишите полностью, например:  
*Иванова Мария Петровна*`;

export const welcomeKz = `*Сәлеметсіз бе!* 👋  
Сіз *2–7 жас аралығындағы баланың сөйлеу дамуын скринингтік бағалау* сервисінде отырсыз.
⏱ *Тесті өту уақыты:* бірнеше минут  
❗ _Нәтижелер ақпараттық сипатта және медициналық диагноз емес_.
👉 *Бастау үшін жазыңыз:*  
*тесті бастау*`;

export const askParentNameKz = `*Ата-ананың толық аты-жөнін көрсетіңіз:*  
Мысалы: *Иванова Мария Петровна*`;

export const welcomeEn = `*Hello!* 👋  
You are using the *child speech development screening service*.
⏱ *Estimated time:* a few minutes  
❗ _Results are for guidance only and do not constitute a medical diagnosis_.
👉 *To start, type:*  
*start test*`;

export const askParentNameEn = `*Please enter the full name of the parent:*  
For example: *Maria Ivanova*`;
